#!/bin/bash

# awk '条件类型1{动作1} 条件类型2{动作2} ...' filename

# 变量名称
# $0 代表一整行数据
# $1-$n 代表第几列数据
# NF 每一行拥有的字段总数（$0）
# NR 目前 awk 处理的是 第几行 数据
# FS 目前的分隔符，默认是空格键

# 处理流程
# 1、读入第一行，并将第一行数据填入$0,$1,$2..$n变量中
# 2、依据条件类型的限制，判断是否要进行后面的动作
# 3、做完所有的动作与条件类型
# 4、若后面还有行数据，则重复1、2、3，直到所有的行读取完毕

cat ips | awk 'BEGIN {FS="."} $4 < 3 {print $4 "\t lines: " NR "\t column: " NF}'

cat awk_data | awk 'NR ==1 {printf "%10s %10s %10s %10s %10s\n", $1,$2,$3,$4,"total"}
 NR > 1 {total=$2+$3+$4; printf "%10s %10s %10s %10s %10s\n", $1,$2,$3,$4,total}'
